#+TITLE: Workbook for DM1
#+AUTHOR: Eric Powell
#+EMAIL: pow13009@byui.edu
#+DATE: 8 January 2018
#+LANGUAGE: en
#+OPTIONS: H:5 num:nil toc:t \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t ':t |:t
#+OPTIONS: html-postamble:t
#+STARTUP: entitiespretty

This is a test for gitHub!

*** OQP

    It is not very clear what I am supposed to do, but here is what I have

    #+BEGIN_SRC  emacs-lisp
123 
    #+END_SRC 

    #+RESULTS:
    : 123
    
    PVP: 3.14159
    #+BEGIN_SRC  emacs-lisp
 3.1415926 
    #+END_SRC 

    #+RESULTS:
    : 3.1415926

    PVP: 42
    #+BEGIN_SRC  emacs-lisp
  42
    #+END_SRC

    #+RESULTS:
    : 42

    PVP: 42
    #+BEGIN_SRC  emacs-lisp
  42.
    #+END_SRC

    #+RESULTS:
    : 42

    PVP: .42
    #+BEGIN_SRC  emacs-lisp
  .42
    #+END_SRC

    #+RESULTS:
    : 0.42

    #+BEGIN_SRC  emacs-lisp
  "Dog bites man --- not news."
    #+END_SRC

    #+RESULTS:
    : Dog bites man --- not news.

    #+BEGIN_SRC  emacs-lisp
  "Man bites dog --- news!"
    #+END_SRC

    #+RESULTS:
    : Man bites dog --- news!

    #+BEGIN_SRC  emacs-lisp
  ?H
    #+END_SRC

    #+RESULTS:
    : 72

    #+BEGIN_SRC  emacs-lisp
  ?a
    #+END_SRC

    #+RESULTS:
    : 97

    #+BEGIN_SRC  emacs-lisp
  t
    #+END_SRC

    #+RESULTS:
    : t

    #+BEGIN_SRC  emacs-lisp
  nil
    #+END_SRC

    #+RESULTS:

    #+BEGIN_SRC  emacs-lisp
  (+ 1 2 3)
    #+END_SRC

    #+RESULTS:
    : 6

    #+BEGIN_SRC  emacs-lisp
  (list 1 3 5)
    #+END_SRC

    #+RESULTS:
    | 1 | 3 | 5 |

    #+BEGIN_SRC  emacs-lisp
  (format "%s" '(1 2 3))
    #+END_SRC

    #+RESULTS:
    : (1 2 3)

    #+BEGIN_SRC  emacs-lisp
  (format "%S" "abc")
    #+END_SRC

    #+RESULTS:
    : "abc"

    #+BEGIN_SRC  emacs-lisp
  (elt [A B C] 0)
    #+END_SRC

    #+RESULTS:
    : A

    #+BEGIN_SRC  emacs-lisp
  (elt [A B C] 2)
    #+END_SRC

    #+RESULTS:
    : C

    #+BEGIN_SRC  emacs-lisp
  (elt [A B C] 3)
    #+END_SRC

    #+BEGIN_SRC  emacs-lisp
  (vector (elt "ABC" 0) (elt "abc" 1) (elt "XyZ" 2))
    #+END_SRC

    #+RESULTS:
    : [65 98 90]

    #+BEGIN_SRC  emacs-lisp
  (append ' (a b c) '(0 1 2))
    #+END_SRC

    #+RESULTS:
    | a | b | c | 0 | 1 | 2 |

    #+BEGIN_SRC  emacs-lisp
  (append [a b c] nil)
    #+END_SRC 

    #+RESULTS:
    | a | b | c |

    Variable Pvp: The program should let you go as far as the list is defined

    #+BEGIN_SRC emacs-lisp
  (setq abc '(1 2 3 4 5 6 7 8 9))
  (first abc)
  (second abc)
  (fifth abc)
    #+END_SRC

    #+RESULTS:
    : 5

    #+BEGIN_SRC emacs-lisp
  (rot13 "zvpxr1@znfgrevatrznpf.bet")
    #+END_SRC 

    #+RESULTS:
    : micke1@masteringemacs.org

    #+BEGIN_SRC emacs-lisp
  (rot13 (rot13 "zvpxr1@znfgrevatrznpf.bet"))
    #+END_SRC 

    #+RESULTS:
    : zvpxr1@znfgrevatrznpf.bet

    PVP -- frobulate
    I predict the outcome will be :7 6 5 4 3 2 1 and thus reverse is a more fitting name

    #+BEGIN_SRC emacs-lisp
  (defun frobulate (x)
     (if x (append (frobulate (rest x)) (list (first x)))))
    #+END_SRC

    #+RESULTS:
    : frobulate

    #+BEGIN_SRC emacs-lisp
  (frobulate '(1 2 3 4 5 6 7))
    #+END_SRC

    #+RESULTS:
    | 7 | 6 | 5 | 4 | 3 | 2 | 1 |

   

*** USV
    #+BEGIN_SRC emacs-lisp
     (rot13 "Or pyrire jvgu ahzoref. 
             Svaq n jnl gb vafreg vagb gurfr gra yvarf gur sbhe 
             fgnaqneq zngu bcrengbef (+, -, \gvzrf, \qvi), be ! 
             (snpgbevny), be \enqvp (fdhner ebbg), naq cneragurfrf 
             sbe tebhcvat, gb znxr gra qvssrerag rkcerffvbaf gung 
             rnpu rinyhngr gb 6. Sbe rknzcyr: \enqvp4 + \enqvp4 + \enqvp4 = 6") 
    #+END_SRC 

    #+RESULTS:
    : Be clever with numbers. 
    :         Find a way to insert into these ten lines the four 
    :         standard math operators (+, -, times, div), or ! 
    :         (factorial), or adic (square root), and parentheses 
    :         for grouping, to make ten different expressions that 
    :         each evaluate to 6. For example: adic4 + adic4 + adic4 = 6
  
    !(!0 + !0 + !0) = 6
 	 	 	 	 	 	 	 
    !(1	+	1	+	1) = 6
 	 	 	 	 	 	 	 
    2 + 2 + 2	 = 6
 	 	 	 	 	 	 	 
    ^[adic( 3	times	3) + 	3	=	6

    ^[adic4 + ^[adic4 + ^[adic4 = 6
 	 	 	 	 	 	 	 
    5	+	(5 div 5)	=	6
 	 	 	 	 	 	 	 
    6	times (6 div 6) =	6
 	 	 	 	 	 	 	 
    7	- (7 div 7)	=	6
 	 	 	 	 	 	 	 
    8	- (^[adic(^[adic(8 + 8)))	=	6
 	 	 	 	 	 	 	 
    !(^[adic9) times (9 div 9) =	6
 	 	 	 	 	 	 	 
**** 1 
     #+BEGIN_SRC  emacs-lisp
      (setq A ["verve" "vim" "vigor"]
            B ["butter" "vinegar" "pepper" "vigor"]
            A-union-B ["verve" "vim" "vigor" "butter" "vinegar" "pepper" "vigor"])
     #+END_SRC 

     #+RESULTS:
     : ["verve" "vim" "vigor" "butter" "vinegar" "pepper" "vigor"]

**** 2  
     #+BEGIN_SRC emacs-lisp
       (seq-intersection '["verve" "vim" "vigor"]
       ["butter" "vinegar" "pepper" "vigor"])
     #+END_SRC 

     #+RESULTS:
     | vigor |

     #+BEGIN_SRC  emacs-lisp
       
     #+END_SRC 

***** and

#+BEGIN_SRC emacs-lisp :results raw
  (let* ((p [It is raining])
         (q [The grass is wet])
         (p-and-q [p and q]))
    (prop-eval p-and-q))
#+END_SRC

#+RESULTS:
([It is raining] (t) and [The grass is wet] (t) yields t)

***** -->

#+BEGIN_SRC emacs-lisp :results raw
  (let* ((p [It is raining])
         (q [The grass is wet])
         (p-onlyif-q [p --> q]))
    (prop-eval p-onlyif-q))
#+END_SRC

#+RESULTS:
([It is raining] (nil) --> [The grass is wet] (t) yields t)
([It is raining] (t) --> [The grass is wet] (nil) yields nil)

***** <-->

#+BEGIN_SRC emacs-lisp :results raw
  (let* ((p [It is raining])
         (q [The grass is wet])
         (p-equivalent-q [p <--> q]))
    (prop-eval p-equivalent-q))
#+END_SRC

#+RESULTS:
([It is raining] (t) <--> [The grass is wet] (t) yields t)

***** OR

#+BEGIN_SRC emacs-lisp :results raw
  (let* ((p [It is raining])
         (q [The grass is wet])
         (p-or-q [p or q]))
    (prop-eval p-or-q))
#+END_SRC

#+RESULTS:
([It is raining] (t) or [The grass is wet] (t) yields t)


